---
kind: method
id: M:Autodesk.Revit.DB.View.IsTemporaryViewPropertiesModeEnabled
zh: 视图
source: html/30e077c5-6417-ceef-41f3-c5a015e19ec8.htm
---
# Autodesk.Revit.DB.View.IsTemporaryViewPropertiesModeEnabled Method

**中文**: 视图

Returns true when Temporary View Properties mode is in progress, false otherwise.

## Syntax (C#)
```csharp
public bool IsTemporaryViewPropertiesModeEnabled()
```